/*<FH+>************************************************************************/
/*                                                                            */
/* 版权所有: Copyright (C) 沈阳新松自动化股份有限公司                         */
/*                                                                            */
/*                                                                            */
/*  文件名称:can_device.h                                                              */
/*  内容摘要:                                                                 */
/*  其它说明:                                                                 */
/*  当前版本:                                                                 */
/*  作    者:QianYizhou                                                       */
/*  完成日期:2013年04月09日                                                   */
/*  修改记录:                                                                 */
/*    修改日期          版本号        修改人        修改内容                  */
/* -------------------------------------------------------------------------- */
/*    2013年04月09日          V4.0        QianYizhou        创建文件          */
/*<FH->************************************************************************/

#ifndef _CAN_DEVICE_H
#define _CAN_DEVICE_H
#ifdef __cplusplus
extern "C"
{
#endif//__cplusplus
/******************************************************************************/
/*               #include（依次为标准库头文件、非标准库头文件）               */
/******************************************************************************/
//#include "../include/public.h"
#include "rsp/rsp_modules/rsp_define.h"

/******************************************************************************/
/*                                 常量定义                                   */
/******************************************************************************/

/******************************************************************************/
/*                                全局宏定义                                  */
/******************************************************************************/

/******************************************************************************/
/*                              全局数据类型声明                              */
/******************************************************************************/

/******************************************************************************/
/*                                全局变量声明                                */
/******************************************************************************/

/******************************************************************************/
/*                                外部引用定义                                */
/******************************************************************************/

/******************************************************************************/
/*                                全局函数原型                                */
/******************************************************************************/
/*<FUNC+>**********************************************************************
* 函数名称:     GPI_CAN_Open
* 功能描述:     打开CAN设备                                                             
* 输入参数: 
*               unsigned char ucChNum   CAN设备端口（从1开始）
* 输出参数: 
*               GPI_HANDLE *pHandle     资源句柄
* 返 回 值: 
*               GPI_RT_SUCCESS    成功
*               其他              错误码
* 操作流程:                                                              
* 其它说明:                                                              
* 修改记录:                                                              
*    修改日期          版本号        修改人        修改内容                  
* -------------------------------------------------------------------------- 
*   2013-9-18           V1.0        QianYizhou      create
*<FUNC->**********************************************************************/
int RSP_CAN_Open( unsigned char ucChNum, RSP_HANDLE *pHandle );

/*<FUNC+>**********************************************************************
* 函数名称:     GPI_CAN_Close
* 功能描述:     关闭CAN设备
* 输入参数: 
*               GPI_HANDLE handle       设备资源句柄
* 输出参数:     
*               NULL
* 返 回 值:     
*               GPI_RT_SUCCESS    成功
*               其他              错误码
* 操作流程:                                                              
* 其它说明:                                                              
* 修改记录:                                                              
*    修改日期          版本号        修改人        修改内容                  
* -------------------------------------------------------------------------- 
*   2013-9-18           V1.0        QianYizhou      create
*<FUNC->**********************************************************************/
int RSP_CAN_Close( RSP_HANDLE handle );

/*<FUNC+>**********************************************************************
* 函数名称:     GPI_CAN_Config
* 功能描述:     配置CAN设备                                                             
* 输入参数: 
*               GPI_HANDLE handle       资源句柄
*               int nBaundRate          波特率
*               int nMsgType            数据类型
* 输出参数: 
*               NULL
* 返 回 值: 
*               GPI_RT_SUCCESS    成功
*               其他              错误码
* 操作流程:                                                              
* 其它说明:                                                              
* 修改记录:                                                              
*    修改日期          版本号        修改人        修改内容                  
* -------------------------------------------------------------------------- 
*   2013-9-18           V1.0        QianYizhou      create
*<FUNC->**********************************************************************/
int RSP_CAN_Config( RSP_HANDLE handle, int nBaundRate, int nMsgType  );

/*<FUNC+>**********************************************************************
* 函数名称:     GPI_CAN_SendBlock
* 功能描述:     CAN发送数据(阻塞式)
* 输入参数: 
*               GPI_HANDLE handle   CAN资源句柄
*               TPCANMsg *ptSendMsg CAN发送数据
* 输出参数:     
*               NULL
* 返 回 值: 
*               GPI_RT_SUCCESS    成功
*               其他              错误码
* 操作流程:                                                              
* 其它说明:                                                              
* 修改记录:                                                              
*    修改日期          版本号        修改人        修改内容                  
* -------------------------------------------------------------------------- 
*   2013-9-18           V1.0        QianYizhou      create
*<FUNC->**********************************************************************/
int RSP_CAN_SendBlock( RSP_HANDLE handle, TPCANMsg* ptSendMsg );

/*<FUNC+>**********************************************************************
* 函数名称:     GPI_CAN_SendTimeOut
* 功能描述:     CAN发送数据(非阻塞式)
* 输入参数: 
*               GPI_HANDLE handle   CAN资源句柄
*               const TPCANMsg *ptSendMsg CAN发送数据
*               int nMicroSeconds   超时时间（单位:ms）
* 输出参数:     
*               NULL
* 返 回 值: 
*               GPI_RT_SUCCESS    成功
*               其他              错误码
* 操作流程:                                                              
* 其它说明:                                                              
* 修改记录:                                                              
*    修改日期          版本号        修改人        修改内容                  
* -------------------------------------------------------------------------- 
*   2013-9-18           V1.0        QianYizhou      create
*<FUNC->**********************************************************************/
int RSP_CAN_SendTimeOut( RSP_HANDLE hHandle, TPCANMsg *ptSendMsg, int nMicroSeconds );

/*<FUNC+>**********************************************************************
* 函数名称:     GPI_CAN_RecvBlock
* 功能描述:     CAN接受数据（阻塞式）
* 输入参数: 
*               GPI_HANDLE handle       CAN资源句柄
* 输出参数:     
*               TPCANRdMsg *ptRecvMsg   CAN接受数据结构体
* 返 回 值: 
*               GPI_RT_SUCCESS    成功
*               其他              错误码
* 操作流程:                                                              
* 其它说明:                                                              
* 修改记录:                                                              
*    修改日期          版本号        修改人        修改内容                  
* -------------------------------------------------------------------------- 
*   2013-9-18           V1.0        QianYizhou      create
*<FUNC->**********************************************************************/
int RSP_CAN_RecvBlock( RSP_HANDLE handle, TPCANRdMsg *ptRecvMsg );

/*<FUNC+>**********************************************************************
* 函数名称:     GPI_CAN_RecvTimeOut
* 功能描述:     CAN接受数据（非阻塞式）
* 输入参数: 
*               GPI_HANDLE handle       CAN资源句柄
*               int nMicroSeconds       超时时间
* 输出参数:     
*               TPCANRdMsg *ptRecvMsg   CAN接受数据结构体
* 返 回 值: 
*               GPI_RT_SUCCESS    成功
*               其他              错误码
* 操作流程:                                                              
* 其它说明:                                                              
* 修改记录:                                                              
*    修改日期          版本号        修改人        修改内容                  
* -------------------------------------------------------------------------- 
*   2013-9-18           V1.0        QianYizhou      create
*<FUNC->**********************************************************************/
int RSP_CAN_RecvTimeOut( RSP_HANDLE handle, TPCANRdMsg *ptRecvMsg, int nMicroSeconds );

#ifdef __cplusplus
}
#endif//__cplusplus

#endif /* endif _CAN_DEVICE_H */


