/*<FH+>************************************************************************/
/*                                                                            */
/* 版权所有: Copyright (C) 沈阳新松自动化股份有限公司                         */
/*                                                                            */
/*                                                                            */
/*  文件名称:com_test.h                                                              */
/*  内容摘要:                                                                 */
/*  其它说明:                                                                 */
/*  当前版本:                                                                 */
/*  作    者:QianYizhou                                                       */
/*  完成日期:2013年04月09日                                                   */
/*  修改记录:                                                                 */
/*    修改日期          版本号        修改人        修改内容                  */
/* -------------------------------------------------------------------------- */
/*    2013年04月09日          V4.0        QianYizhou        创建文件          */
/*<FH->************************************************************************/

#ifndef _COM_TEST_H
#define _COM_TEST_H
#ifdef __cplusplus
extern "C"
{
#endif
/******************************************************************************/
/*               #include（依次为标准库头文件、非标准库头文件）               */
/******************************************************************************/
//#include <stdio.h>
//#include <string.h>
//#include <sys/types.h>
//#include <sys/stat.h>
//#include <fcntl.h>
//#include <unistd.h>
//#include <termios.h>

//#include "public.h"
//#include "../include/public.h"
//#include "rsp.h"
#include <stdbool.h>
#include "rsp/rsp_modules/rsp_define.h"
/******************************************************************************/
/*                                 常量定义                                   */
/******************************************************************************/
/*define feram select block id*/
typedef enum
{
	ENUM_FERAM_FOR_ARM = 0,
	ENUM_FERAM_FOR_WHEEL	
}enFeramBlock_t;

/******************************************************************************/
/*                                全局宏定义                                  */
/******************************************************************************/

/******************************************************************************/
/*                              全局数据类型声明                              */
/******************************************************************************/

/******************************************************************************/
/*                                全局变量声明                                */
/******************************************************************************/

/******************************************************************************/
/*                                外部引用定义                                */
/******************************************************************************/

/******************************************************************************/
/*                                全局函数原型                                */
/******************************************************************************/
/*<FUNC+>**********************************************************************
* 函数名称:     GPI_Feram_Init                                                             
* 功能描述:     铁电设备初始化
* 输入参数:
*               NULL
* 输出参数:                                                              
*               void** pAddr    铁电首地址
* 返 回 值:                                                              
*               GPI_RT_SUCCESS  成功
*               其他            错误码
* 操作流程:                                                              
* 其它说明:                                                              
* 修改记录:                                                              
*    修改日期          版本号        修改人        修改内容                  
* -------------------------------------------------------------------------- 
*   2013-9-18           V1.0        QianYizhou      create
*<FUNC->**********************************************************************/
int RSP_Feram_Open( void** pAddr );

/*<FUNC+>**********************************************************************
* 函数名称:     GPI_Feram_Uninit                                                             
* 功能描述:     铁电设备反初始化
* 输入参数:
*               NULL
* 输出参数:                                                              
*               NULL
* 返 回 值:                                                              
*               GPI_RT_SUCCESS  成功
*               其他            错误码
* 操作流程:                                                              
* 其它说明:                                                              
* 修改记录:                                                              
*    修改日期          版本号        修改人        修改内容                  
* -------------------------------------------------------------------------- 
*   2013-9-18           V1.0        QianYizhou      create
*<FUNC->**********************************************************************/
int RSP_Feram_Close( void );

/*<FUNC+>**********************************************************************
* 函数名称:     GPI_Feram_Read                                                             
* 功能描述:     读取铁电设备内容
* 输入参数:
*               unsigned int pos    偏移位置
*               unsigned int len    读取内容长度
*               注意：铁电可读写范围：0～512KB
* 输出参数:                                                              
*               unsigned char *pBuf 读取内容缓存
* 返 回 值:                                                              
*               GPI_RT_SUCCESS  成功
*               其他            错误码
* 操作流程:                                                              
* 其它说明:                                                              
* 修改记录:                                                              
*    修改日期          版本号        修改人        修改内容                  
* -------------------------------------------------------------------------- 
*   2013-9-18           V1.0        QianYizhou      create
*<FUNC->**********************************************************************/
int RSP_Feram_Read( unsigned int pos, unsigned char *pBuf, unsigned int len );

/*<FUNC+>**********************************************************************
* 函数名称:     GPI_Feram_Write
* 功能描述:     向铁电设备写入内容
* 输入参数:
*               unsigned int pos    偏移位置
*               unsigned char *pBuf 写入内容缓存
*               unsigned int len    写入内容长度
*               注意：铁电可读写范围：0～512KB
* 输出参数:                                                              
*               NULL
* 返 回 值:                                                              
*               GPI_RT_SUCCESS  成功
*               其他            错误码
* 操作流程:                                                              
* 其它说明:                                                              
* 修改记录:                                                              
*    修改日期          版本号        修改人        修改内容                  
* -------------------------------------------------------------------------- 
*   2013-9-18           V1.0        QianYizhou      create
*<FUNC->**********************************************************************/
int RSP_Feram_Write( unsigned int pos, const unsigned char *pBuf, unsigned int len );

/*<FUNC+>**********************************************************************
* 函数名称: RSP_Feram_Sync                                                             
* 功能描述: sync feram manually
* 输入参数: 
*               NULL
* 输出参数:
*               NULL
* 返 回 值:
*               true    have synced to feram
*               false   have NOT synced to feram
* 操作流程:                                                              
* 其它说明:                                                              
* 修改记录:                                                              
*    修改日期          版本号        修改人        修改内容                  
* -------------------------------------------------------------------------- 
*<FUNC->**********************************************************************/
bool RSP_Feram_Sync( void );

#ifdef __cplusplus
}
#endif
#endif /* endif COM_TEST_H */


