/*<FH+>************************************************************************/
/*                                                                            */
/* 版权所有: Copyright (C) 沈阳新松自动化股份有限公司                         */
/*                                                                            */
/*                                                                            */
/*  文件名称:rsp_clockirq_if.h                                                              */
/*  内容摘要:                                                                 */
/*  其它说明:                                                                 */
/*  当前版本:                                                                 */
/*  作    者:QianYizhou                                                       */
/*  完成日期:2013年09月18日                                                   */
/*  修改记录:                                                                 */
/*    修改日期          版本号        修改人        修改内容                  */
/* -------------------------------------------------------------------------- */
/*    2013年09月18日          V1.0        QianYizhou        创建文件          */
/*<FH->************************************************************************/
#ifndef _RSP_CLOCKIRQ_IF_H
#define _RSP_CLOCKIRQ_IF_H

#ifdef  __cplusplus
extern "C"
{
#endif//__cplusplus

/*<FUNC+>**********************************************************************
* 函数名称:     RSP_Clock_Open                                                             
* 功能描述:     打开硬件时钟
* 输入参数:
*               NULL
* 输出参数:                                                              
*               NULL
* 返 回 值:                                                              
*               RSP_RT_SUCCESS  成功
*               其他            错误码
* 操作流程:                                                              
* 其它说明:                                                              
* 修改记录:                                                              
*    修改日期          版本号        修改人        修改内容                  
* -------------------------------------------------------------------------- 
*   2013-9-18           V1.0        QianYizhou      create
*<FUNC->**********************************************************************/
int RSP_Clock_Open( void );

/*<FUNC+>**********************************************************************
* 函数名称:     RSP_Clock_Close                                                             
* 功能描述:     关闭硬件时钟
* 输入参数:
*               NULL
* 输出参数:                                                              
*               NULL
* 返 回 值:                                                              
*               RSP_RT_SUCCESS  成功
*               其他            错误码
* 操作流程:                                                              
* 其它说明:                                                              
* 修改记录:                                                              
*    修改日期          版本号        修改人        修改内容                  
* -------------------------------------------------------------------------- 
*   2013-9-18           V1.0        QianYizhou      create
*<FUNC->**********************************************************************/
int RSP_Clock_Close( void );

/*<FUNC+>**********************************************************************
* 函数名称:     RSP_Clock_Config                                                             
* 功能描述:     配置硬件时钟
* 输入参数:
*               int nMilliSeconds           时钟中断周期（单位：毫秒,范围0－255）
*                                           其中0表示永久阻塞
* 输出参数:                                                              
* 返 回 值:                                                              
*               RSP_RT_SUCCESS  成功
*               其他            错误码
* 操作流程:                                                              
* 其它说明:                                                              
* 修改记录:                                                              
*    修改日期          版本号        修改人        修改内容                  
* -------------------------------------------------------------------------- 
*   2013-9-18           V1.0        QianYizhou      create
*<FUNC->**********************************************************************/
int RSP_Clock_Config( int nMilliSeconds );

/*<FUNC+>**********************************************************************
* 函数名称:     RSP_Clock_EnableIrq
* 功能描述:     启用时钟中断
* 输入参数:
*               NULL
* 输出参数:                                                              
*               NULL
* 返 回 值:                                                              
*               NULL
* 操作流程:                                                              
* 其它说明:                                                              
* 修改记录:                                                              
*    修改日期          版本号        修改人        修改内容                  
* -------------------------------------------------------------------------- 
*   2013-9-18           V1.0        QianYizhou      create
*<FUNC->**********************************************************************/
void RSP_Clock_EnableIrq( void );

/*<FUNC+>**********************************************************************
* 函数名称:     RSP_ClockIrq_DisableIrq
* 功能描述:     禁用时钟中断
* 输入参数:
*               NULL
* 输出参数:                                                              
*               NULL
* 返 回 值:                                                              
*               NULL
* 操作流程:                                                              
* 其它说明:                                                              
* 修改记录:                                                              
*    修改日期          版本号        修改人        修改内容                  
* -------------------------------------------------------------------------- 
*   2013-9-18           V1.0        QianYizhou      create
*<FUNC->**********************************************************************/
void RSP_Clock_DisableIrq( void );

/*<FUNC+>**********************************************************************
* 函数名称:     RSP_ClockIrq_WaitIrq
* 功能描述:     阻塞等待时钟中断
* 输入参数:
*               NULL
* 输出参数:                                                              
*               NULL
* 返 回 值:                                                              
*               NULL
* 操作流程:                                                              
* 其它说明:                                                              
* 修改记录:                                                              
*    修改日期          版本号        修改人        修改内容                  
* -------------------------------------------------------------------------- 
*   2013-9-18           V1.0        QianYizhou      create
*<FUNC->**********************************************************************/
void RSP_Clock_WaitIrq( void );

#ifdef  __cplusplus
}
#endif//__cplusplus

#endif /* end of include guard: _RSP_CLOCKIRQ_IF_H */



